In [1]:
import os
import sys
import json
from datetime import datetime
from os import system, name
from time import sleep
import copy
import threading
import imp
import numpy as np
import altair as alt
import matplotlib.pyplot as plt
import matplotlib.dates as mdates
import pandas as pd
import pandasql as psql
from  libraries.utility import Utility

from libraries.data_objects import data_objects

/tmp/ipykernel_834621/1270873248.py:9: DeprecationWarning: the imp module is deprecated in favour of importlib and slated for removal in Python 3.12; see the module's documentation for alternative uses
  import imp

In [2]:
mdo = data_objects()

In [3]:
df=mdo.ca_city_lat_long_df()

In [4]:
df.head()

           city   Latitude   Longitude
0      Adelanto  34.582769 -117.409214
1  Agoura Hills  34.153339 -118.761675
2       Alameda  37.765206 -122.241636
3        Albany  37.886869 -122.297747
4      Alhambra  34.095286 -118.127014

In [5]:
sql = '''
select city, Latitude ||','|| Longitude as lat_long from df
'''
psql.sqldf(sql).head(5)

           city               lat_long
0      Adelanto  34.582769,-117.409214
1  Agoura Hills  34.153339,-118.761675
2       Alameda  37.765206,-122.241636
3        Albany  37.886869,-122.297747
4      Alhambra  34.095286,-118.127014

In [6]:
df=pd.DataFrame(mdo.ca_pop_df())

In [7]:
city='Alhambra'
my_sql='''
select
pop_april_2010 as population
from df
where ltrim(rtrim(lower(City))) = \'''' + city.strip().lower() + '''\'
'''
psql.sqldf(my_sql)

   population
0       83089

In [8]:
city='Alhambra'
mdo.ca_pop_by_city(city=city)

   population
0       83089

In [9]:
mdo.bg_pop_tuple()

((600, 600),
 (1200, 1200),
 (1800, 1800),
 (2400, 2400),
 (3000, 3000),
 (3600, 3600),
 (4800, 4800),
 (5400, 5400),
 (6000, 6000))